{"format": "graph-model", "generatedBy": "2.19.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"xs_0": {"name": "xs_0:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2048"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "214"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/jax2tf_get_logits_/Const_16", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_1/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_1/BroadcastTo/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/Const_14", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_1/Sum_1/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_1/truediv_1_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/Const_11", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/Const_10", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/Const_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/Const_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/Reshape/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/BroadcastTo/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/BroadcastTo/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/Const_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/Sum_1/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/truediv_1_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/Const_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/pjit__one_hot_/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/pjit__one_hot_/Reshape/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/pjit__one_hot_/BroadcastTo/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/pjit__one_hot_/BroadcastTo/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/pjit__one_hot_/BroadcastTo_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "257"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_3/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "257"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Dense_0/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Reshape/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/Reshape_1/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/Reshape_1/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/BroadcastTo_1/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/BroadcastTo_1/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/Const_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/Reshape_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/Reshape_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "512"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Conv_0/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Conv_0/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Conv_0/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Conv_0/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Conv_0/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Conv_0/transpose_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "1"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Conv_0/transpose_4/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Conv_0/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Conv_0/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Conv_0/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Conv_0/transpose_5/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Conv_0/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Max/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_1/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_1/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_1/Reshape_1/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_1/BroadcastTo_1/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/Const_15", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_1/Reshape_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_1/Reshape_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_arg_5/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "214"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Dense_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "214"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/Max/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/BroadcastTo/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/Reshape_1/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/BroadcastTo_1/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/assert_equal_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "xs_0", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "2048"}]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/Shape", "op": "Shape", "input": ["xs_0"], "attr": {"T": {"type": "DT_INT32"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/Shape", "StatefulPartitionedCall/jax2tf_get_logits_/strided_slice/stack", "StatefulPartitionedCall/jax2tf_get_logits_/strided_slice/stack_1", "StatefulPartitionedCall/jax2tf_get_logits_/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_1/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/strided_slice", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_1/Reshape/shape/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_1/BroadcastTo/shape", "op": "Pack", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/strided_slice", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_1/BroadcastTo/shape/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/strided_slice", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/Reshape/shape/1", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/Reshape/shape/2"], "attr": {"N": {"i": "3"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/BroadcastTo/shape", "op": "Pack", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/strided_slice", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/BroadcastTo/shape/1", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/BroadcastTo/shape/2"], "attr": {"N": {"i": "3"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/pjit__one_hot_/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/strided_slice", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/pjit__one_hot_/Reshape/shape/1", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/pjit__one_hot_/Reshape/shape/2"], "attr": {"N": {"i": "3"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/pjit__one_hot_/BroadcastTo/shape", "op": "Pack", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/strided_slice", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/pjit__one_hot_/BroadcastTo/shape/1", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/pjit__one_hot_/BroadcastTo/shape/2"], "attr": {"N": {"i": "3"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/strided_slice", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Reshape/shape/1", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Reshape/shape/2"], "attr": {"N": {"i": "3"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/Reshape_1/shape", "op": "Pack", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/strided_slice", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/Reshape_1/shape/1", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/Reshape_1/shape/2"], "attr": {"N": {"i": "3"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/BroadcastTo_1/shape", "op": "Pack", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/strided_slice", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/BroadcastTo_1/shape/1", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/BroadcastTo_1/shape/2"], "attr": {"N": {"i": "3"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_1/Reshape_1/shape", "op": "Pack", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/strided_slice", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_1/Reshape_1/shape/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_1/BroadcastTo_1/shape", "op": "Pack", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/strided_slice", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_1/BroadcastTo_1/shape/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/strided_slice", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/Reshape/shape/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/BroadcastTo/shape", "op": "Pack", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/strided_slice", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/BroadcastTo/shape/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/Reshape_1/shape", "op": "Pack", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/strided_slice", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/Reshape_1/shape/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/BroadcastTo_1/shape", "op": "Pack", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/strided_slice", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/BroadcastTo_1/shape/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/GreaterEqual", "op": "GreaterEqual", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/strided_slice", "StatefulPartitionedCall/Const"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/pjit__one_hot_/Reshape", "op": "Reshape", "input": ["xs_0", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/pjit__one_hot_/Reshape/shape"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/assert_equal_1/Equal", "op": "Equal", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/GreaterEqual", "StatefulPartitionedCall/jax2tf_get_logits_/assert_equal_1/y"], "attr": {"T": {"type": "DT_BOOL"}, "incompatible_shape_error": {"b": true}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/pjit__one_hot_/BroadcastTo", "op": "BroadcastTo", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/pjit__one_hot_/Reshape", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/pjit__one_hot_/BroadcastTo/shape"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/assert_equal_1/Assert/AssertGuard/StatefulPartitionedCall/jax2tf_get_logits_/assert_equal_1/y/_20", "op": "Switch", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/assert_equal_1/y", "StatefulPartitionedCall/jax2tf_get_logits_/assert_equal_1/Equal"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/assert_equal_1/Assert/AssertGuard/StatefulPartitionedCall/jax2tf_get_logits_/assert_equal_1/All/_18", "op": "Switch", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/assert_equal_1/Equal", "StatefulPartitionedCall/jax2tf_get_logits_/assert_equal_1/Equal"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/assert_equal_1/Assert/AssertGuard/switch_pred/_15", "op": "Switch", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/assert_equal_1/Equal", "StatefulPartitionedCall/jax2tf_get_logits_/assert_equal_1/Equal"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/assert_equal_1/Assert/AssertGuard/StatefulPartitionedCall/jax2tf_get_logits_/GreaterEqual/_19", "op": "Switch", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/GreaterEqual", "StatefulPartitionedCall/jax2tf_get_logits_/assert_equal_1/Equal"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/pjit__one_hot_/Equal", "op": "Equal", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/pjit__one_hot_/BroadcastTo", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/pjit__one_hot_/BroadcastTo_1"], "attr": {"T": {"type": "DT_INT32"}, "incompatible_shape_error": {"b": true}}}, {"name": "ConstantFoldingCtrl/StatefulPartitionedCall/jax2tf_get_logits_/assert_equal_1/Assert/AssertGuard/switch_pred/_15_0", "op": "Identity", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/assert_equal_1/Assert/AssertGuard/switch_pred/_15"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "ConstantFoldingCtrl/StatefulPartitionedCall/jax2tf_get_logits_/assert_equal_1/Assert/AssertGuard/switch_pred/_15_1", "op": "Identity", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/assert_equal_1/Assert/AssertGuard/switch_pred/_15:1"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/pjit__one_hot_/Cast_1", "op": "Cast", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/pjit__one_hot_/Equal"], "attr": {"SrcT": {"type": "DT_BOOL"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/assert_equal_1/Assert/AssertGuard/pivot_f/_16", "op": "Const", "input": ["^ConstantFoldingCtrl/StatefulPartitionedCall/jax2tf_get_logits_/assert_equal_1/Assert/AssertGuard/switch_pred/_15_0"], "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/assert_equal_1/Assert/AssertGuard/pivot_t/_17", "op": "Const", "input": ["^ConstantFoldingCtrl/StatefulPartitionedCall/jax2tf_get_logits_/assert_equal_1/Assert/AssertGuard/switch_pred/_15_1"], "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Dense_0/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/pjit__one_hot_/Cast_1", "StatefulPartitionedCall/jax2tf_arg_3/ReadVariableOp"], "attr": {"equation": {"s": "YWJmLGZlLT5hYmU="}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/jax2tf_get_logits_/assert_equal_1/Assert/AssertGuard/else/_14/input/_32", "op": "Identity", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/assert_equal_1/Assert/AssertGuard/StatefulPartitionedCall/jax2tf_get_logits_/assert_equal_1/y/_20", "^StatefulPartitionedCall/jax2tf_get_logits_/assert_equal_1/Assert/AssertGuard/pivot_f/_16"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "Func/StatefulPartitionedCall/jax2tf_get_logits_/assert_equal_1/Assert/AssertGuard/else/_14/input/_30", "op": "Identity", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/assert_equal_1/Assert/AssertGuard/StatefulPartitionedCall/jax2tf_get_logits_/assert_equal_1/All/_18", "^StatefulPartitionedCall/jax2tf_get_logits_/assert_equal_1/Assert/AssertGuard/pivot_f/_16"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "Func/StatefulPartitionedCall/jax2tf_get_logits_/assert_equal_1/Assert/AssertGuard/else/_14/input/_31", "op": "Identity", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/assert_equal_1/Assert/AssertGuard/StatefulPartitionedCall/jax2tf_get_logits_/GreaterEqual/_19", "^StatefulPartitionedCall/jax2tf_get_logits_/assert_equal_1/Assert/AssertGuard/pivot_f/_16"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Dense_0/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Dense_0/einsum/Einsum", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Dense_0/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/assert_equal_1/Assert/AssertGuard/branch_executed/_22", "op": "Merge", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/assert_equal_1/Assert/AssertGuard/pivot_t/_17", "StatefulPartitionedCall/jax2tf_get_logits_/assert_equal_1/Assert/AssertGuard/pivot_f/_16", "^Func/StatefulPartitionedCall/jax2tf_get_logits_/assert_equal_1/Assert/AssertGuard/else/_14/input/_32", "^Func/StatefulPartitionedCall/jax2tf_get_logits_/assert_equal_1/Assert/AssertGuard/else/_14/input/_31", "^Func/StatefulPartitionedCall/jax2tf_get_logits_/assert_equal_1/Assert/AssertGuard/else/_14/input/_30"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/ApplyActivation_0/Mul_4", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/Const_3", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Dense_0/AddV2"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/ApplyActivation_0/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/Const", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Dense_0/AddV2"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/ApplyActivation_0/ArithmeticOptimizer/ReplaceMulWithSquare_Mul_1", "op": "Square", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Dense_0/AddV2"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/ApplyActivation_0/Mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/ApplyActivation_0/Mul", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/ApplyActivation_0/ArithmeticOptimizer/ReplaceMulWithSquare_Mul_1"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/ApplyActivation_0/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Dense_0/AddV2", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/ApplyActivation_0/Mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/ApplyActivation_0/Mul_3", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/Const_1", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/ApplyActivation_0/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/ApplyActivation_0/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/ApplyActivation_0/Mul_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/ApplyActivation_0/AddV2_1", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/Const_2", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/ApplyActivation_0/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/ApplyActivation_0/Mul_5", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/ApplyActivation_0/Mul_4", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/ApplyActivation_0/AddV2_1"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/ApplyActivation_0/Mul_5", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/Square", "op": "Square", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/Sum", "op": "Sum", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Reshape", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/Sum/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/Sum_1", "op": "Sum", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/Square", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/Sum_1/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/Sum", "ConstantFolding/StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/truediv_1", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/Sum_1", "ConstantFolding/StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/truediv_1_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/truediv", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/Square_1", "op": "Square", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/BroadcastTo", "op": "BroadcastTo", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/Reshape", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/BroadcastTo/shape"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/Sub", "op": "Sub", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/truediv_1", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/Square_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/Sub_1", "op": "Sub", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Reshape", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/BroadcastTo"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/Maximum", "op": "Maximum", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/Const_6", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/Sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/Maximum", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/BroadcastTo_1", "op": "BroadcastTo", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/Reshape_1", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/BroadcastTo_1/shape"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/BroadcastTo_1", "StatefulPartitionedCall/jax2tf_get_logits_/Const_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/Rsqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/Rsqrt", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/Reshape_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/Mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/Sub_1", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/AddV2_1", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/Mul_1", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/Reshape_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Conv_0/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_0/AddV2_1", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Conv_0/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-8"}, {"size": "512"}, {"size": "256"}]}, {"dim": [{"size": "3"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Conv_0/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Conv_0/transpose", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Conv_0/strided_slice/stack", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Conv_0/strided_slice/stack_1", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Conv_0/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "8"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "7"}, "end_mask": {"i": "7"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Conv_0/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Conv_0/strided_slice", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Conv_0/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-9"}, {"size": "256"}, {"size": "512"}, {"size": "1"}]}, {"dim": [{"size": "4"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Conv_0/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Conv_0/transpose_1", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Conv_0/transpose_3"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-9"}, {"size": "512"}, {"size": "1"}, {"size": "256"}]}, {"dim": [{"size": "5"}, {"size": "1"}, {"size": "256"}, {"size": "512"}]}]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Conv_0/transpose_4", "op": "Transpose", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Conv_0/Conv2D", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Conv_0/transpose_4/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-9"}, {"size": "508"}, {"size": "1"}, {"size": "512"}]}, {"dim": [{"size": "4"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Conv_0/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Conv_0/transpose_4", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Conv_0/strided_slice_2/stack", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Conv_0/strided_slice_2/stack_1", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Conv_0/strided_slice_2/stack_2"], "attr": {"shrink_axis_mask": {"i": "8"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "7"}, "end_mask": {"i": "7"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Conv_0/transpose_5", "op": "Transpose", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Conv_0/strided_slice_2", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Conv_0/transpose_5/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-10"}, {"size": "512"}, {"size": "508"}]}, {"dim": [{"size": "3"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Conv_0/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Conv_0/transpose_5", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Conv_0/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/ApplyActivation_1/Mul_4", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/Const_11", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Conv_0/AddV2"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/ApplyActivation_1/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/Const_8", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Conv_0/AddV2"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/ApplyActivation_1/ArithmeticOptimizer/ReplaceMulWithSquare_Mul_1", "op": "Square", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Conv_0/AddV2"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/ApplyActivation_1/Mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/ApplyActivation_1/Mul", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/ApplyActivation_1/ArithmeticOptimizer/ReplaceMulWithSquare_Mul_1"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/ApplyActivation_1/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Conv_0/AddV2", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/ApplyActivation_1/Mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/ApplyActivation_1/Mul_3", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/Const_9", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/ApplyActivation_1/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/ApplyActivation_1/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/ApplyActivation_1/Mul_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/ApplyActivation_1/AddV2_1", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/Const_10", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/ApplyActivation_1/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/ApplyActivation_1/Mul_5", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/ApplyActivation_1/Mul_4", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/ApplyActivation_1/AddV2_1"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Max", "op": "Max", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/ApplyActivation_1/Mul_5", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Max/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_1/Square", "op": "Square", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Max"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_1/Sum", "op": "Sum", "input": ["StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/Max", "StatefulPartitionedCall/jax2tf_get_logits_/pjit_get_logits_/MagikaV2/LayerNorm_1/Sum/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}}}, {"name": 