{
  "format": "graph-model",
  "generatedBy": "2.15.0",
  "convertedBy": "TensorFlow.js Converter v4.16.0",
  "signature": {
    "inputs": {
      "model_input": {
        "name": "model_input:0",
        "dtype": "DT_FLOAT",
        "tensorShape": { "dim": [{ "size": "-1" }, { "size": "1536" }] }
      }
    },
    "outputs": {
      "model_1": {
        "name": "Identity:0",
        "dtype": "DT_FLOAT",
        "tensorShape": { "dim": [{ "size": "-1" }, { "size": "113" }] }
      }
    }
  },
  "modelTopology": {
    "node": [
      {
        "name": "StatefulPartitionedCall/edited_model/layer_normalization_16/Reshape_1",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "256" }, { "size": "1" }]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_2/Gelu/mul/x",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": {} } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_2/Gelu/add/x",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": {} } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_2/Tensordot/Const",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_2/Tensordot/axes",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_2/Tensordot/GatherV2_1/axis",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_2/Tensordot/Const_1",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_2/Tensordot/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "256" }, { "size": "256" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_1/Gelu/mul/x",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": {} } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_1/Gelu/add/x",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": {} } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_1/Tensordot/Const",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_1/Tensordot/axes",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_1/Tensordot/GatherV2_1/axis",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_1/Tensordot/Const_1",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_1/Tensordot/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "512" }, { "size": "256" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/layer_normalization/Reshape_1",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "384" }, { "size": "1" }]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense/Gelu/mul/x",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": {} } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense/Gelu/add/x",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": {} } }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense/Tensordot/Const",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense/Tensordot/axes",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense/Tensordot/GatherV2_1/axis",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense/Tensordot/Const_1",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense/Tensordot/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "257" }, { "size": "128" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/tf.one_hot/one_hot/depth",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/tf.one_hot/one_hot/on_value",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": {} } }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/tf.one_hot/one_hot/off_value",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": {} } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense/Tensordot/free",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "2" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense/Tensordot/GatherV2/axis",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense/Tensordot/Const_2",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense/Tensordot/concat_1/axis",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "ConstantFolding/StatefulPartitionedCall/edited_model/model/dense/Gelu/truediv_recip",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": {} } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/reshape/strided_slice/stack",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/reshape/strided_slice/stack_1",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/reshape/strided_slice/stack_2",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/reshape/Reshape/shape/1",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/reshape/Reshape/shape/2",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/layer_normalization/moments/mean/reduction_indices",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/layer_normalization/moments/variance/reduction_indices",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/layer_normalization/batchnorm/add/y",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": {} } }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/layer_normalization/Reshape",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "384" }, { "size": "1" }]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_1/Tensordot/free",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "2" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_1/Tensordot/GatherV2/axis",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_1/Tensordot/Const_2",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_1/Tensordot/concat_1/axis",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_1/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "256" }] }
            }
          }
        }
      },
      {
        "name": "ConstantFolding/StatefulPartitionedCall/edited_model/model/dense_1/Gelu/truediv_recip",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": {} } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_2/Tensordot/free",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "2" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_2/Tensordot/GatherV2/axis",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_2/Tensordot/Const_2",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_2/Tensordot/concat_1/axis",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_2/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "256" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "ConstantFolding/StatefulPartitionedCall/edited_model/model/dense_2/Gelu/truediv_recip",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": {} } }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/global_max_pooling1d/Max/reduction_indices",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/reshape_0/strided_slice/stack",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/reshape_0/strided_slice/stack_1",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/reshape_0/strided_slice/stack_2",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/reshape_0/Reshape/shape/1",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/reshape_0/Reshape/shape/2",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/layer_normalization_16/moments/mean/reduction_indices",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/layer_normalization_16/moments/variance/reduction_indices",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/layer_normalization_16/batchnorm/add/y",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": {} } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/layer_normalization_16/Reshape",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "256" }, { "size": "1" }]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/flatten_15/Const",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "2" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model_1/target_label/MatMul/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "256" }, { "size": "113" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model_1/target_label/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "113" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "model_input",
        "op": "Placeholder",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "shape": {
            "shape": { "dim": [{ "size": "-1" }, { "size": "1536" }] }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/tf.cast/Cast",
        "op": "Cast",
        "input": ["model_input"],
        "attr": {
          "SrcT": { "type": "DT_FLOAT" },
          "DstT": { "type": "DT_INT32" },
          "Truncate": { "b": false }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/tf.one_hot/one_hot",
        "op": "OneHot",
        "input": [
          "StatefulPartitionedCall/edited_model/model/tf.cast/Cast",
          "StatefulPartitionedCall/edited_model/model/tf.one_hot/one_hot/depth",
          "StatefulPartitionedCall/edited_model/model/tf.one_hot/one_hot/on_value",
          "StatefulPartitionedCall/edited_model/model/tf.one_hot/one_hot/off_value"
        ],
        "attr": {
          "axis": { "i": "-1" },
          "TI": { "type": "DT_INT32" },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense/Tensordot/Shape",
        "op": "Shape",
        "input": [
          "StatefulPartitionedCall/edited_model/model/tf.one_hot/one_hot"
        ],
        "attr": {
          "T": { "type": "DT_FLOAT" },
          "out_type": { "type": "DT_INT32" }
        },
        "experimentalType": {
          "typeId": "TFT_PRODUCT",
          "args": [
            {
              "typeId": "TFT_SHAPE_TENSOR",
              "args": [{ "typeId": "TFT_INT32" }]
            }
          ]
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense/Tensordot/GatherV2_1",
        "op": "GatherV2",
        "input": [
          "StatefulPartitionedCall/edited_model/model/dense/Tensordot/Shape",
          "StatefulPartitionedCall/edited_model/model/dense/Tensordot/axes",
          "StatefulPartitionedCall/edited_model/model/dense/Tensordot/GatherV2_1/axis"
        ],
        "attr": {
          "Tindices": { "type": "DT_INT32" },
          "Tparams": { "type": "DT_INT32" },
          "batch_dims": { "i": "0" },
          "Taxis": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense/Tensordot/GatherV2",
        "op": "GatherV2",
        "input": [
          "StatefulPartitionedCall/edited_model/model/dense/Tensordot/Shape",
          "StatefulPartitionedCall/edited_model/model/dense/Tensordot/free",
          "StatefulPartitionedCall/edited_model/model/dense/Tensordot/GatherV2/axis"
        ],
        "attr": {
          "Tparams": { "type": "DT_INT32" },
          "Tindices": { "type": "DT_INT32" },
          "batch_dims": { "i": "0" },
          "Taxis": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense/Tensordot/Prod_1",
        "op": "Prod",
        "input": [
          "StatefulPartitionedCall/edited_model/model/dense/Tensordot/GatherV2_1",
          "StatefulPartitionedCall/edited_model/model/dense/Tensordot/Const_1"
        ],
        "attr": {
          "T": { "type": "DT_INT32" },
          "Tidx": { "type": "DT_INT32" },
          "keep_dims": { "b": false }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense/Tensordot/Prod",
        "op": "Prod",
        "input": [
          "StatefulPartitionedCall/edited_model/model/dense/Tensordot/GatherV2",
          "StatefulPartitionedCall/edited_model/model/dense/Tensordot/Const"
        ],
        "attr": {
          "keep_dims": { "b": false },
          "T": { "type": "DT_INT32" },
          "Tidx": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense/Tensordot/concat_1",
        "op": "ConcatV2",
        "input": [
          "StatefulPartitionedCall/edited_model/model/dense/Tensordot/GatherV2",
          "StatefulPartitionedCall/edited_model/model/dense/Tensordot/Const_2",
          "StatefulPartitionedCall/edited_model/model/dense/Tensordot/concat_1/axis"
        ],
        "attr": {
          "Tidx": { "type": "DT_INT32" },
          "N": { "i": "2" },
          "T": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense/Tensordot/stack",
        "op": "Pack",
        "input": [
          "StatefulPartitionedCall/edited_model/model/dense/Tensordot/Prod",
          "StatefulPartitionedCall/edited_model/model/dense/Tensordot/Prod_1"
        ],
        "attr": {
          "T": { "type": "DT_INT32" },
          "N": { "i": "2" },
          "axis": { "i": "0" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense/Tensordot/Reshape",
        "op": "Reshape",
        "input": [
          "StatefulPartitionedCall/edited_model/model/tf.one_hot/one_hot",
          "StatefulPartitionedCall/edited_model/model/dense/Tensordot/stack"
        ],
        "attr": {
          "Tshape": { "type": "DT_INT32" },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense/Tensordot/MatMul",
        "op": "MatMul",
        "input": [
          "StatefulPartitionedCall/edited_model/model/dense/Tensordot/Reshape",
          "StatefulPartitionedCall/edited_model/model/dense/Tensordot/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "transpose_a": { "b": false },
          "transpose_b": { "b": false },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense/Tensordot",
        "op": "Reshape",
        "input": [
          "StatefulPartitionedCall/edited_model/model/dense/Tensordot/MatMul",
          "StatefulPartitionedCall/edited_model/model/dense/Tensordot/concat_1"
        ],
        "attr": {
          "Tshape": { "type": "DT_INT32" },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense/BiasAdd",
        "op": "BiasAdd",
        "input": [
          "StatefulPartitionedCall/edited_model/model/dense/Tensordot",
          "StatefulPartitionedCall/edited_model/model/dense/BiasAdd/ReadVariableOp"
        ],
        "attr": {
          "T": { "type": "DT_FLOAT" },
          "data_format": { "s": "TkhXQw==" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense/Gelu/mul",
        "op": "Mul",
        "input": [
          "StatefulPartitionedCall/edited_model/model/dense/Gelu/mul/x",
          "StatefulPartitionedCall/edited_model/model/dense/BiasAdd"
        ],
        "attr": {
          "T": { "type": "DT_FLOAT" },
          "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": { "b": true }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense/Gelu/truediv",
        "op": "Mul",
        "input": [
          "StatefulPartitionedCall/edited_model/model/dense/BiasAdd",
          "ConstantFolding/StatefulPartitionedCall/edited_model/model/dense/Gelu/truediv_recip"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense/Gelu/Erf",
        "op": "Erf",
        "input": [
          "StatefulPartitionedCall/edited_model/model/dense/Gelu/truediv"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense/Gelu/add",
        "op": "AddV2",
        "input": [
          "StatefulPartitionedCall/edited_model/model/dense/Gelu/add/x",
          "StatefulPartitionedCall/edited_model/model/dense/Gelu/Erf"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense/Gelu/mul_1",
        "op": "Mul",
        "input": [
          "StatefulPartitionedCall/edited_model/model/dense/Gelu/mul",
          "StatefulPartitionedCall/edited_model/model/dense/Gelu/add"
        ],
        "attr": {
          "T": { "type": "DT_FLOAT" },
          "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": { "b": true }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/reshape/Shape",
        "op": "Shape",
        "input": [
          "StatefulPartitionedCall/edited_model/model/dense/Gelu/mul_1"
        ],
        "attr": {
          "T": { "type": "DT_FLOAT" },
          "out_type": { "type": "DT_INT32" }
        },
        "experimentalType": {
          "typeId": "TFT_PRODUCT",
          "args": [
            {
              "typeId": "TFT_SHAPE_TENSOR",
              "args": [{ "typeId": "TFT_INT32" }]
            }
          ]
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/reshape/strided_slice",
        "op": "StridedSlice",
        "input": [
          "StatefulPartitionedCall/edited_model/model/reshape/Shape",
          "StatefulPartitionedCall/edited_model/model/reshape/strided_slice/stack",
          "StatefulPartitionedCall/edited_model/model/reshape/strided_slice/stack_1",
          "StatefulPartitionedCall/edited_model/model/reshape/strided_slice/stack_2"
        ],
        "attr": {
          "T": { "type": "DT_INT32" },
          "shrink_axis_mask": { "i": "1" },
          "ellipsis_mask": { "i": "0" },
          "end_mask": { "i": "0" },
          "new_axis_mask": { "i": "0" },
          "begin_mask": { "i": "0" },
          "Index": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/reshape/Reshape/shape",
        "op": "Pack",
        "input": [
          "StatefulPartitionedCall/edited_model/model/reshape/strided_slice",
          "StatefulPartitionedCall/edited_model/model/reshape/Reshape/shape/1",
          "StatefulPartitionedCall/edited_model/model/reshape/Reshape/shape/2"
        ],
        "attr": {
          "N": { "i": "3" },
          "T": { "type": "DT_INT32" },
          "axis": { "i": "0" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/reshape/Reshape",
        "op": "Reshape",
        "input": [
          "StatefulPartitionedCall/edited_model/model/dense/Gelu/mul_1",
          "StatefulPartitionedCall/edited_model/model/reshape/Reshape/shape"
        ],
        "attr": {
          "T": { "type": "DT_FLOAT" },
          "Tshape": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/layer_normalization/moments/mean",
        "op": "Mean",
        "input": [
          "StatefulPartitionedCall/edited_model/model/reshape/Reshape",
          "StatefulPartitionedCall/edited_model/model/layer_normalization/moments/mean/reduction_indices"
        ],
        "attr": {
          "T": { "type": "DT_FLOAT" },
          "keep_dims": { "b": true },
          "Tidx": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/layer_normalization/moments/SquaredDifference",
        "op": "SquaredDifference",
        "input": [
          "StatefulPartitionedCall/edited_model/model/reshape/Reshape",
          "StatefulPartitionedCall/edited_model/model/layer_normalization/moments/mean"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/layer_normalization/moments/variance",
        "op": "Mean",
        "input": [
          "StatefulPartitionedCall/edited_model/model/layer_normalization/moments/SquaredDifference",
          "StatefulPartitionedCall/edited_model/model/layer_normalization/moments/variance/reduction_indices"
        ],
        "attr": {
          "keep_dims": { "b": true },
          "Tidx": { "type": "DT_INT32" },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/layer_normalization/batchnorm/add",
        "op": "AddV2",
        "input": [
          "StatefulPartitionedCall/edited_model/model/layer_normalization/moments/variance",
          "StatefulPartitionedCall/edited_model/model/layer_normalization/batchnorm/add/y"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/layer_normalization/batchnorm/Rsqrt",
        "op": "Rsqrt",
        "input": [
          "StatefulPartitionedCall/edited_model/model/layer_normalization/batchnorm/add"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/layer_normalization/batchnorm/mul",
        "op": "Mul",
        "input": [
          "StatefulPartitionedCall/edited_model/model/layer_normalization/batchnorm/Rsqrt",
          "StatefulPartitionedCall/edited_model/model/layer_normalization/Reshape"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/layer_normalization/batchnorm/mul_2",
        "op": "Mul",
        "input": [
          "StatefulPartitionedCall/edited_model/model/layer_normalization/moments/mean",
          "StatefulPartitionedCall/edited_model/model/layer_normalization/batchnorm/mul"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/layer_normalization/batchnorm/mul_1",
        "op": "Mul",
        "input": [
          "StatefulPartitionedCall/edited_model/model/reshape/Reshape",
          "StatefulPartitionedCall/edited_model/model/layer_normalization/batchnorm/mul"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/layer_normalization/batchnorm/sub",
        "op": "Sub",
        "input": [
          "StatefulPartitionedCall/edited_model/model/layer_normalization/Reshape_1",
          "StatefulPartitionedCall/edited_model/model/layer_normalization/batchnorm/mul_2"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/layer_normalization/batchnorm/add_1",
        "op": "AddV2",
        "input": [
          "StatefulPartitionedCall/edited_model/model/layer_normalization/batchnorm/mul_1",
          "StatefulPartitionedCall/edited_model/model/layer_normalization/batchnorm/sub"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_1/Tensordot/Shape",
        "op": "Shape",
        "input": [
          "StatefulPartitionedCall/edited_model/model/layer_normalization/batchnorm/add_1"
        ],
        "attr": {
          "out_type": { "type": "DT_INT32" },
          "T": { "type": "DT_FLOAT" }
        },
        "experimentalType": {
          "typeId": "TFT_PRODUCT",
          "args": [
            {
              "typeId": "TFT_SHAPE_TENSOR",
              "args": [{ "typeId": "TFT_INT32" }]
            }
          ]
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_1/Tensordot/GatherV2_1",
        "op": "GatherV2",
        "input": [
          "StatefulPartitionedCall/edited_model/model/dense_1/Tensordot/Shape",
          "StatefulPartitionedCall/edited_model/model/dense_1/Tensordot/axes",
          "StatefulPartitionedCall/edited_model/model/dense_1/Tensordot/GatherV2_1/axis"
        ],
        "attr": {
          "Tindices": { "type": "DT_INT32" },
          "batch_dims": { "i": "0" },
          "Taxis": { "type": "DT_INT32" },
          "Tparams": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_1/Tensordot/GatherV2",
        "op": "GatherV2",
        "input": [
          "StatefulPartitionedCall/edited_model/model/dense_1/Tensordot/Shape",
          "StatefulPartitionedCall/edited_model/model/dense_1/Tensordot/free",
          "StatefulPartitionedCall/edited_model/model/dense_1/Tensordot/GatherV2/axis"
        ],
        "attr": {
          "Tindices": { "type": "DT_INT32" },
          "Tparams": { "type": "DT_INT32" },
          "batch_dims": { "i": "0" },
          "Taxis": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_1/Tensordot/Prod_1",
        "op": "Prod",
        "input": [
          "StatefulPartitionedCall/edited_model/model/dense_1/Tensordot/GatherV2_1",
          "StatefulPartitionedCall/edited_model/model/dense_1/Tensordot/Const_1"
        ],
        "attr": {
          "T": { "type": "DT_INT32" },
          "Tidx": { "type": "DT_INT32" },
          "keep_dims": { "b": false }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_1/Tensordot/Prod",
        "op": "Prod",
        "input": [
          "StatefulPartitionedCall/edited_model/model/dense_1/Tensordot/GatherV2",
          "StatefulPartitionedCall/edited_model/model/dense_1/Tensordot/Const"
        ],
        "attr": {
          "Tidx": { "type": "DT_INT32" },
          "keep_dims": { "b": false },
          "T": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_1/Tensordot/concat_1",
        "op": "ConcatV2",
        "input": [
          "StatefulPartitionedCall/edited_model/model/dense_1/Tensordot/GatherV2",
          "StatefulPartitionedCall/edited_model/model/dense_1/Tensordot/Const_2",
          "StatefulPartitionedCall/edited_model/model/dense_1/Tensordot/concat_1/axis"
        ],
        "attr": {
          "T": { "type": "DT_INT32" },
          "Tidx": { "type": "DT_INT32" },
          "N": { "i": "2" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_1/Tensordot/stack",
        "op": "Pack",
        "input": [
          "StatefulPartitionedCall/edited_model/model/dense_1/Tensordot/Prod",
          "StatefulPartitionedCall/edited_model/model/dense_1/Tensordot/Prod_1"
        ],
        "attr": {
          "N": { "i": "2" },
          "axis": { "i": "0" },
          "T": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_1/Tensordot/Reshape",
        "op": "Reshape",
        "input": [
          "StatefulPartitionedCall/edited_model/model/layer_normalization/batchnorm/add_1",
          "StatefulPartitionedCall/edited_model/model/dense_1/Tensordot/stack"
        ],
        "attr": {
          "Tshape": { "type": "DT_INT32" },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_1/Tensordot/MatMul",
        "op": "MatMul",
        "input": [
          "StatefulPartitionedCall/edited_model/model/dense_1/Tensordot/Reshape",
          "StatefulPartitionedCall/edited_model/model/dense_1/Tensordot/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "transpose_b": { "b": false },
          "transpose_a": { "b": false },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_1/Tensordot",
        "op": "Reshape",
        "input": [
          "StatefulPartitionedCall/edited_model/model/dense_1/Tensordot/MatMul",
          "StatefulPartitionedCall/edited_model/model/dense_1/Tensordot/concat_1"
        ],
        "attr": {
          "Tshape": { "type": "DT_INT32" },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_1/BiasAdd",
        "op": "BiasAdd",
        "input": [
          "StatefulPartitionedCall/edited_model/model/dense_1/Tensordot",
          "StatefulPartitionedCall/edited_model/model/dense_1/BiasAdd/ReadVariableOp"
        ],
        "attr": {
          "T": { "type": "DT_FLOAT" },
          "data_format": { "s": "TkhXQw==" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_1/Gelu/mul",
        "op": "Mul",
        "input": [
          "StatefulPartitionedCall/edited_model/model/dense_1/Gelu/mul/x",
          "StatefulPartitionedCall/edited_model/model/dense_1/BiasAdd"
        ],
        "attr": {
          "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": { "b": true },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_1/Gelu/truediv",
        "op": "Mul",
        "input": [
          "StatefulPartitionedCall/edited_model/model/dense_1/BiasAdd",
          "ConstantFolding/StatefulPartitionedCall/edited_model/model/dense_1/Gelu/truediv_recip"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_1/Gelu/Erf",
        "op": "Erf",
        "input": [
          "StatefulPartitionedCall/edited_model/model/dense_1/Gelu/truediv"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_1/Gelu/add",
        "op": "AddV2",
        "input": [
          "StatefulPartitionedCall/edited_model/model/dense_1/Gelu/add/x",
          "StatefulPartitionedCall/edited_model/model/dense_1/Gelu/Erf"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_1/Gelu/mul_1",
        "op": "Mul",
        "input": [
          "StatefulPartitionedCall/edited_model/model/dense_1/Gelu/mul",
          "StatefulPartitionedCall/edited_model/model/dense_1/Gelu/add"
        ],
        "attr": {
          "T": { "type": "DT_FLOAT" },
          "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": { "b": true }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_2/Tensordot/Shape",
        "op": "Shape",
        "input": [
          "StatefulPartitionedCall/edited_model/model/dense_1/Gelu/mul_1"
        ],
        "attr": {
          "T": { "type": "DT_FLOAT" },
          "out_type": { "type": "DT_INT32" }
        },
        "experimentalType": {
          "typeId": "TFT_PRODUCT",
          "args": [
            {
              "typeId": "TFT_SHAPE_TENSOR",
              "args": [{ "typeId": "TFT_INT32" }]
            }
          ]
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_2/Tensordot/GatherV2_1",
        "op": "GatherV2",
        "input": [
          "StatefulPartitionedCall/edited_model/model/dense_2/Tensordot/Shape",
          "StatefulPartitionedCall/edited_model/model/dense_2/Tensordot/axes",
          "StatefulPartitionedCall/edited_model/model/dense_2/Tensordot/GatherV2_1/axis"
        ],
        "attr": {
          "Tparams": { "type": "DT_INT32" },
          "Taxis": { "type": "DT_INT32" },
          "batch_dims": { "i": "0" },
          "Tindices": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_2/Tensordot/GatherV2",
        "op": "GatherV2",
        "input": [
          "StatefulPartitionedCall/edited_model/model/dense_2/Tensordot/Shape",
          "StatefulPartitionedCall/edited_model/model/dense_2/Tensordot/free",
          "StatefulPartitionedCall/edited_model/model/dense_2/Tensordot/GatherV2/axis"
        ],
        "attr": {
          "Tindices": { "type": "DT_INT32" },
          "Tparams": { "type": "DT_INT32" },
          "Taxis": { "type": "DT_INT32" },
          "batch_dims": { "i": "0" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_2/Tensordot/Prod_1",
        "op": "Prod",
        "input": [
          "StatefulPartitionedCall/edited_model/model/dense_2/Tensordot/GatherV2_1",
          "StatefulPartitionedCall/edited_model/model/dense_2/Tensordot/Const_1"
        ],
        "attr": {
          "T": { "type": "DT_INT32" },
          "Tidx": { "type": "DT_INT32" },
          "keep_dims": { "b": false }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_2/Tensordot/Prod",
        "op": "Prod",
        "input": [
          "StatefulPartitionedCall/edited_model/model/dense_2/Tensordot/GatherV2",
          "StatefulPartitionedCall/edited_model/model/dense_2/Tensordot/Const"
        ],
        "attr": {
          "Tidx": { "type": "DT_INT32" },
          "keep_dims": { "b": false },
          "T": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_2/Tensordot/concat_1",
        "op": "ConcatV2",
        "input": [
          "StatefulPartitionedCall/edited_model/model/dense_2/Tensordot/GatherV2",
          "StatefulPartitionedCall/edited_model/model/dense_2/Tensordot/Const_2",
          "StatefulPartitionedCall/edited_model/model/dense_2/Tensordot/concat_1/axis"
        ],
        "attr": {
          "Tidx": { "type": "DT_INT32" },
          "N": { "i": "2" },
          "T": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_2/Tensordot/stack",
        "op": "Pack",
        "input": [
          "StatefulPartitionedCall/edited_model/model/dense_2/Tensordot/Prod",
          "StatefulPartitionedCall/edited_model/model/dense_2/Tensordot/Prod_1"
        ],
        "attr": {
          "axis": { "i": "0" },
          "N": { "i": "2" },
          "T": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_2/Tensordot/Reshape",
        "op": "Reshape",
        "input": [
          "StatefulPartitionedCall/edited_model/model/dense_1/Gelu/mul_1",
          "StatefulPartitionedCall/edited_model/model/dense_2/Tensordot/stack"
        ],
        "attr": {
          "Tshape": { "type": "DT_INT32" },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_2/Tensordot/MatMul",
        "op": "MatMul",
        "input": [
          "StatefulPartitionedCall/edited_model/model/dense_2/Tensordot/Reshape",
          "StatefulPartitionedCall/edited_model/model/dense_2/Tensordot/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "transpose_b": { "b": false },
          "transpose_a": { "b": false },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_2/Tensordot",
        "op": "Reshape",
        "input": [
          "StatefulPartitionedCall/edited_model/model/dense_2/Tensordot/MatMul",
          "StatefulPartitionedCall/edited_model/model/dense_2/Tensordot/concat_1"
        ],
        "attr": {
          "Tshape": { "type": "DT_INT32" },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/edited_model/model/dense_2/BiasAdd",
        "op": "BiasAdd",
        "input": [
