{"format": "graph-model", "generatedBy": "2.15.1", "convertedBy": "TensorFlow.js Converter v4.20.0", "signature": {"inputs": {"bytes": {"name": "bytes:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "-1"}, {"size": "4096"}]}}}, "outputs": {"target_label": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "212"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model/layer_normalization_1/Reshape/shape/0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/layer_normalization_1/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/layer_normalization_1/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/layer_normalization_1/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/layer_normalization_1/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/layer_normalization_1/Reshape/shape/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/layer_normalization_1/ones/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/layer_normalization_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/layer_normalization_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/layer_normalization_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/layer_normalization_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/layer_normalization_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/layer_normalization_1/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/layer_normalization_1/Const_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv1d/Gelu/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv1d/Gelu/add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/layer_normalization/Reshape_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1024"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense/Gelu/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense/Gelu/add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "257"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/one_hot_to_float/one_hot/depth", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/one_hot_to_float/one_hot/on_value", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/one_hot_to_float/one_hot/off_value", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/model/dense/Gelu/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/reshape/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/reshape/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/reshape/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/reshape/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/reshape/Reshape/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/layer_normalization/moments/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/layer_normalization/moments/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/layer_normalization/batchnorm/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/layer_normalization/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1024"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv1d/Conv1D/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/conv1d/Conv1D/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv1d/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/model/conv1d/Gelu/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/global_max_pooling1d/Max/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/layer_normalization_1/mul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/layer_normalization_1/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/target_label/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "212"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/target_label/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "212"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "bytes", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "4096"}]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/one_hot_to_float/one_hot", "op": "OneHot", "input": ["bytes", "StatefulPartitionedCall/model/one_hot_to_float/one_hot/depth", "StatefulPartitionedCall/model/one_hot_to_float/one_hot/on_value", "StatefulPartitionedCall/model/one_hot_to_float/one_hot/off_value"], "attr": {"axis": {"i": "-1"}, "TI": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model/one_hot_to_float/one_hot"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/model/dense/Tensordot/Shape", "StatefulPartitionedCall/model/dense/Tensordot/axes", "StatefulPartitionedCall/model/dense/Tensordot/GatherV2_1/axis"], "attr": {"Tparams": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/model/dense/Tensordot/Shape", "StatefulPartitionedCall/model/dense/Tensordot/free", "StatefulPartitionedCall/model/dense/Tensordot/GatherV2/axis"], "attr": {"Tparams": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/model/dense/Tensordot/GatherV2_1", "StatefulPartitionedCall/model/dense/Tensordot/Const_1"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/model/dense/Tensordot/GatherV2", "StatefulPartitionedCall/model/dense/Tensordot/Const"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model/dense/Tensordot/GatherV2", "StatefulPartitionedCall/model/dense/Tensordot/Const_2", "StatefulPartitionedCall/model/dense/Tensordot/concat_1/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model/dense/Tensordot/Prod", "StatefulPartitionedCall/model/dense/Tensordot/Prod_1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model/one_hot_to_float/one_hot", "StatefulPartitionedCall/model/dense/Tensordot/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/model/dense/Tensordot/Reshape", "StatefulPartitionedCall/model/dense/Tensordot/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"grad_a": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/model/dense/Tensordot/MatMul", "StatefulPartitionedCall/model/dense/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model/dense/Tensordot", "StatefulPartitionedCall/model/dense/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense/Gelu/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/dense/Gelu/mul/x", "StatefulPartitionedCall/model/dense/BiasAdd"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense/Gelu/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/model/dense/BiasAdd", "ConstantFolding/StatefulPartitionedCall/model/dense/Gelu/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense/Gelu/Erf", "op": "Erf", "input": ["StatefulPartitionedCall/model/dense/Gelu/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense/Gelu/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/dense/Gelu/add/x", "StatefulPartitionedCall/model/dense/Gelu/Erf"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense/Gelu/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model/dense/Gelu/mul", "StatefulPartitionedCall/model/dense/Gelu/add"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/reshape/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model/dense/Gelu/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/model/reshape/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/reshape/Shape", "StatefulPartitionedCall/model/reshape/strided_slice/stack", "StatefulPartitionedCall/model/reshape/strided_slice/stack_1", "StatefulPartitionedCall/model/reshape/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/reshape/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/model/reshape/strided_slice", "StatefulPartitionedCall/model/reshape/Reshape/shape/1", "StatefulPartitionedCall/model/reshape/Reshape/shape/2"], "attr": {"N": {"i": "3"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/reshape/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model/dense/Gelu/mul_1", "StatefulPartitionedCall/model/reshape/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/layer_normalization/moments/mean", "op": "Mean", "input": ["StatefulPartitionedCall/model/reshape/Reshape", "StatefulPartitionedCall/model/layer_normalization/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/model/layer_normalization/moments/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/model/reshape/Reshape", "StatefulPartitionedCall/model/layer_normalization/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/layer_normalization/moments/variance", "op": "Mean", "input": ["StatefulPartitionedCall/model/layer_normalization/moments/SquaredDifference", "StatefulPartitionedCall/model/layer_normalization/moments/variance/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/model/layer_normalization/batchnorm/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/layer_normalization/moments/variance", "StatefulPartitionedCall/model/layer_normalization/batchnorm/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/layer_normalization/batchnorm/Rsqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/model/layer_normalization/batchnorm/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/layer_normalization/batchnorm/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/layer_normalization/batchnorm/Rsqrt", "StatefulPartitionedCall/model/layer_normalization/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/layer_normalization/batchnorm/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/model/layer_normalization/moments/mean", "StatefulPartitionedCall/model/layer_normalization/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/layer_normalization/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model/reshape/Reshape", "StatefulPartitionedCall/model/layer_normalization/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/layer_normalization/batchnorm/sub", "op": "Sub", "input": ["StatefulPartitionedCall/model/layer_normalization/Reshape_1", "StatefulPartitionedCall/model/layer_normalization/batchnorm/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/layer_normalization/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/model/layer_normalization/batchnorm/mul_1", "StatefulPartitionedCall/model/layer_normalization/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv1d/Conv1D/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/model/layer_normalization/batchnorm/add_1", "StatefulPartitionedCall/model/conv1d/Conv1D/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv1d/Conv1D", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/conv1d/Conv1D/ExpandDims", "StatefulPartitionedCall/model/conv1d/Conv1D/ExpandDims_1", "StatefulPartitionedCall/model/conv1d/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/conv1d/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/model/conv1d/Conv1D"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/model/conv1d/Gelu/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/conv1d/Gelu/mul/x", "StatefulPartitionedCall/model/conv1d/BiasAdd"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv1d/Gelu/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/model/conv1d/BiasAdd", "ConstantFolding/StatefulPartitionedCall/model/conv1d/Gelu/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv1d/Gelu/Erf", "op": "Erf", "input": ["StatefulPartitionedCall/model/conv1d/Gelu/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv1d/Gelu/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/conv1d/Gelu/add/x", "StatefulPartitionedCall/model/conv1d/Gelu/Erf"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv1d/Gelu/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model/conv1d/Gelu/mul", "StatefulPartitionedCall/model/conv1d/Gelu/add"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/global_max_pooling1d/Max", "op": "Max", "input": ["StatefulPartitionedCall/model/conv1d/Gelu/mul_1", "StatefulPartitionedCall/model/global_max_pooling1d/Max/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/model/layer_normalization_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model/global_max_pooling1d/Max"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/model/layer_normalization_1/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/layer_normalization_1/Shape", "StatefulPartitionedCall/model/layer_normalization_1/strided_slice_1/stack", "StatefulPartitionedCall/model/layer_normalization_1/strided_slice_1/stack_1", "StatefulPartitionedCall/model/layer_normalization_1/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/layer_normalization_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/layer_normalization_1/Shape", "StatefulPartitionedCall/model/layer_normalization_1/strided_slice/stack", "StatefulPartitionedCall/model/layer_normalization_1/strided_slice/stack_1", "StatefulPartitionedCall/model/layer_normalization_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/layer_normalization_1/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/model/layer_normalization_1/strided_slice_1", "StatefulPartitionedCall/model/layer_normalization_1/Const_1"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/model/layer_normalization_1/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/model/layer_normalization_1/strided_slice", "StatefulPartitionedCall/model/layer_normalization_1/Const"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/model/layer_normalization_1/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/model/layer_normalization_1/Reshape/shape/0", "StatefulPartitionedCall/model/layer_normalization_1/Prod", "StatefulPartitionedCall/model/layer_normalization_1/Prod_1", "StatefulPartitionedCall/model/layer_normalization_1/Reshape/shape/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/model/layer_normalization_1/ones/packed_const_axis", "op": "Const", "input": ["^StatefulPartitionedCall/model/layer_normalization_1/Prod"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/model/layer_normalization_1/zeros/packed_const_axis", "op": "Const", "input": ["^StatefulPartitionedCall/model/layer_normalization_1/Prod"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/layer_normalization_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model/global_max_pooling1d/Max", "StatefulPartitionedCall/model/layer_normalization_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/layer_normalization_1/ones/packed", "op": "ExpandDims", "input": ["StatefulPartitionedCall/model/layer_normalization_1/Prod", "ConstantFolding/StatefulPartitionedCall/model/layer_normalization_1/ones/packed_const_axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/layer_normalization_1/zeros/packed", "op": "ExpandDims", "input": ["StatefulPartitionedCall/model/layer_normalization_1/Prod", "ConstantFolding/StatefulPartitionedCall/model/layer_normalization_1/zeros/packed_const_axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/layer_normalization_1/ones", "op": "Fill", "input": ["StatefulPartitionedCall/model/layer_normalization_1/ones/packed", "StatefulPartitionedCall/model/layer_normalization_1/ones/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/layer_normalization_1/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/model/layer_normalization_1/zeros/packed", "StatefulPartitionedCall/model/layer_normalization_1/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/layer_normalization_1/FusedBatchNormV3", "op": "FusedBatchNormV3", "input": ["StatefulPartitionedCall/model/layer_normalization_1/Reshape", "StatefulPartitionedCall/model/layer_normalization_1/ones", "StatefulPartitionedCall/model/layer_normalization_1/zeros", "StatefulPartitionedCall/model/layer_normalization_1/Const_2", "StatefulPartitionedCall/model/layer_normalization_1/Const_3"], "attr": {"exponential_avg_factor": {"f": 1.0}, "data_format": {"s": "TkNIVw=="}, "T": {"type": "DT_FLOAT"}, "U": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.001}, "is_training": {"b": true}}}, {"name": "StatefulPartitionedCall/model/layer_normalization_1/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/model/layer_normalization_1/FusedBatchNormV3", "StatefulPartitionedCall/model/layer_normalization_1/Shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/layer_normalization_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/layer_normalization_1/Reshape_1", "StatefulPartitionedCall/model/layer_normalization_1/mul/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/layer_normalization_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/layer_normalization_1/mul", "StatefulPartitionedCall/model/layer_normalization_1/add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/target_label/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/layer_normalization_1/add", "StatefulPartitionedCall/model/target_label/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/target_label/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/target_label/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/model/target_label/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model/target_label/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1882}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/model/layer_normalization_1/Reshape/shape/0", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/layer_normalization_1/strided_slice_1/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/layer_normalization_1/strided_slice_1/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/layer_normalization_1/strided_slice_1/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/layer_normalization_1/Const_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/layer_normalization_1/Reshape/shape/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/layer_normalization_1/ones/Const", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/layer_normalization_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/layer_normalization_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/layer_normalization_1/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/layer_normalization_1/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/layer_normalization_1/zeros/Const", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/layer_normalization_1/Const_2", "shape": [0], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/layer_normalization_1/Const_3", "shape": [0], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/conv1d/Gelu/mul/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/conv1d/Gelu/add/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/layer_normalization/Reshape_1", "shape": [1, 1024, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/dense/Gelu/mul/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/dense/Gelu/add/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/ReadVariableOp", "shape": [257, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/one_hot_to_float/one_hot/depth", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/one_hot_to_float/one_hot/on_value", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/one_hot_to_float/one_hot/off_value", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/free", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/dense/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/model/dense/Gelu/truediv_recip", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/reshape/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/reshape/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/reshape/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/reshape/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/reshape/Reshape/shape/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/layer_normalization/moments/mean/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/layer_normalization/moments/variance/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/layer_normalization/batchnorm/add/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/layer_normalization/Reshape", "shape": [1, 1024, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/conv1d/Conv1D/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/conv1d/Conv1D/ExpandDims_1", "shape": [1, 5, 256, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/conv1d/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/model/conv1d/Gelu/truediv_recip", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/global_max_pooling1d/Max/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/layer_normalization_1/mul/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/layer_normalization_1/add/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/target_label/MatMul/ReadVariableOp", "shape": [512, 212], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/target_label/BiasAdd/ReadVariableOp", "shape": [212], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/model/layer_normalization_1/ones/packed_const_axis", "shape": [], "dtype": "int32"}, {"name": "ConstantFolding/StatefulPartitionedCall/model/layer_normalization_1/zeros/packed_const_axis", "shape": [], "dtype": "int32"}]}]}